; domain
(define (domain pmp)
    (:requirements :strips )
    (:types
        objs 
        locs
    )
    (:predicates
        (robot-at ?loc - locs)
        (object-at ?ob - objs ?loc - locs)
        (clear ?ob - objs)
        (hand-empty)
        (holding ?ob - objs)
        (on ?top - objs ?bot - objs)
    )

    (:action pick
        :parameters (?ob - objs  ?oloc - locs)
        :precondition (and  (hand-empty) (clear ?ob) (robot-at ?oloc) 
                      (object-at ?ob ?oloc))
        :effect (and (holding ?ob) (not (clear ?ob)) (not (hand-empty)) 
                (not (object-at ?ob ?oloc)))
    )

    (:action place
        :parameters (?ob - objs  ?oloc - locs)
        :precondition (and (holding ?ob) (robot-at ?oloc) 
                      (not (object-at ?ob ?oloc)))
        :effect (and (hand-empty) (not (holding ?ob)) (clear ?ob) 
                (object-at ?ob ?oloc))
    )

    (:action stack
        :parameters (?top - objs ?bot - objs ?rloc - locs)
        :precondition (and (clear ?bot) (holding ?top) (robot-at ?rloc) (object-at ?bot ?rloc))
        :effect (and (on ?top ?bot) (hand-empty) (not (holding ?top)) 
                (not (clear ?bot)) (object-at ?top ?rloc))
    )

    (:action unstack
        :parameters (?top - objs ?bot - objs ?rloc - locs)
        :precondition (and (on ?top ?bot) (hand-empty) (clear ?top) 
                      (robot-at ?rloc) (object-at ?top ?rloc))
        :effect (and (not (on ?top ?bot)) (holding ?top) (not (clear ?top)) 
                (not (hand-empty)) (clear ?bot))
    )
    

    (:action move
        :parameters (?loc1 - locs ?loc2 - locs)
        :precondition (and (robot-at ?loc1) (not (robot-at ?loc2)) (hand-empty))
        :effect (and (robot-at ?loc2) (not (robot-at ?loc1)))
    )
    
    (:action move-holding
        :parameters (?obj - objs ?loc1 - locs ?loc2 - locs)
        :precondition (and (holding ?obj) (not (hand-empty))  (robot-at ?loc1) (not (robot-at ?loc2)) )
        :effect (and (robot-at ?loc2) (not (robot-at ?loc1)) )
    )
)

; problem
(define (problem problem1) (:domain pmp)
(:objects  
    red - objs
    blue - objs 
    green - objs
    A - locs 
    B - locs
    C - locs
)

(:init
    (object-at red A)
    (object-at blue A)
    (object-at green B)
    (on red blue)
    (hand-empty)
    (robot-at C)
    (clear red)
    (clear green)
)

(:goal (and
    (object-at blue B)
    ;(robot-at B)
))

;un-comment the following line if metric is needed
;(:metric minimize (???))
)

; plan
1. (move c a)
   deleted: (robot-at c)
   added: (robot-at a)
   goals met: 0 of 1
2. (unstack red blue a)
   deleted: (on red blue) (clear red) (hand-empty)
   added: (holding red) (clear blue)
   goals met: 0 of 1
3. (move-holding red a b)
   deleted: (robot-at a)
   added: (robot-at b)
   goals met: 0 of 1
4. (place red b)
   deleted: (holding red)
   added: (hand-empty) (clear red) (object-at red b)
   goals met: 0 of 1
5. (move b a)
   deleted: (robot-at b)
   added: (robot-at a)
   goals met: 0 of 1
6. (pick blue a)
   deleted: (clear blue) (hand-empty) (object-at blue a)
   added: (holding blue)
   goals met: 0 of 1
7. (move-holding blue a b)
   deleted: (robot-at a)
   added: (robot-at b)
   goals met: 0 of 1
8. (place blue b)
   deleted: (holding blue)
   added: (hand-empty) (clear blue) (object-at blue b)
   goals met: 1 of 1
